MatMyfta/ML-on-MSP430/main.c
#include <msp430.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include "main.h"


fixed weights[MEMORY_SIZE+UPDATE_THR][K];
uint16_t y_train[MEMORY_SIZE+UPDATE_THR];
fixed centroids[K][N_FEATURE];
#pragma PERSISTENT(max_samples)
fixed max_samples[MEMORY_SIZE+UPDATE_THR][N_FEATURE] = {0};
#pragma PERSISTENT(_X_train)
fixed _X_train[N_TRAIN][N_FEATURE] = {0};
#pragma PERSISTENT(_X_test)
fixed _X_test[N_TEST][N_FEATURE] = {0};

/**
 * main.c
 */
int main(void)
{

	// Stop watchdog timer
	WDTCTL = WDTPW | WDTHOLD;

    // Disable the GPIO power-on default high-impedance mode to activate
    // previously configured port settings
    PM5CTL0 &= ~LOCKLPM5;

    // RTC
    RTC_start();


    #ifdef PRINT
    printf("AEP initialization\n\n");
    #endif

	uint16_t n_samples;
    uint16_t pred_class, pred_class_perm;
    float acc = 0;
    float acc_perm = 0;
	uint16_t counter = 0;
	uint16_t increment = 0;
	uint16_t i, j;

	n_samples = INITIAL_THR; 		// MAX MEMORY ALLOCATION

	// READ INITIAL DATA
	for (i = 0; i < n_samples; i++) {
		for (j = 0; j < N_FEATURE; j++) {
			max_samples[i][j] = F_LIT(X_train[i][j]);
		}
	}
	#ifdef PRINT
	printf("\t> Initial data read correctly from FRAM\n");
	#endif

    // Read test data
    for (i = 0; i < N_TEST; i++) {
        for (j = 0; j < N_FEATURE; j++) {
            _X_test[i][j] = F_LIT(X_test[i][j]);
        }
    }
	#ifdef PRINT
	printf("\t> Test data read correctly from FRAM\n");
	#endif

    // Read train data
    for (i = 0; i < N_TRAIN; i++) {
        for (j = 0; j < N_FEATURE; j++) {
            _X_train[i][j] = F_LIT(X_train[i][j]);
        }
    }
	#ifdef PRINT
	printf("\t> Train data read correctly from FRAM\n\n");
	#endif

    #ifdef PRINT
    #ifdef AUTO_DT
    printf("* Decision Tree classifier: \n\n");
    printf("\t- Max Depth: %d\n", MAX_DEPTH);
    printf("\t- Min Size: %d\n\n", MIN_SIZE);
    #endif

    #ifdef AUTO_KNN
    printf("* KNN classifier:\n\n");
    printf("\t- Number of neighbors: %d\n\n", K_NEIGHBOR);
    #endif
    #endif

	counter = n_samples;

	while (1) {

		n_samples = kmeans(max_samples, centroids, weights, y_train, n_samples);

		if (n_samples > MEMORY_SIZE) {

            uint16_t indices[MEMORY_SIZE + UPDATE_THR];

            for(i=0; i<n_samples; i++)
                indices[i]=i;

            quicksort_idx(y_train, indices, 0, n_samples-1);
            n_samples = update_mem(max_samples, indices, n_samples);

			// FIFO
			for(i = 0; i < MEMORY_SIZE; i++) {
				for(j = 0; j < N_FEATURE; j++)
					max_samples[i][j] = max_samples[i+(n_samples - MEMORY_SIZE)][j];
				y_train[i] = y_train[i+(n_samples - MEMORY_SIZE)];
			}
			n_samples = MEMORY_SIZE;
		}

		struct Node* root = (struct Node*)realloc(NULL, sizeof(struct Node));
        #ifdef AUTO_DT
		root = decision_tree_training(max_samples, root, y_train, n_samples);
        #endif


        // Compute classification
		for (j = 0; j < N_TEST; j++) {

            #ifdef AUTO_DT
			pred_class = decision_tree_classifier(root, _X_test[j]);
            #endif

            #ifdef AUTO_KNN
            pred_class = knn_classification(_X_test[j], max_samples, y_train, n_samples);
            #endif

			pred_class_perm = 1 - pred_class;
			if(pred_class == y_test[j])
				acc++;
			else if(pred_class_perm == y_test[j])
				acc_perm++;
		}

		if (acc_perm > acc)
			acc = acc_perm;

        #ifdef _PRINT
        #ifdef AUTO_DT
        printf ("^ Decision Tree:\n\n");
        printf ("\t- Number of samples correctly classified using the Decision Tree: %0.0f\n", acc);
        #endif //AUTO_DT

        #ifdef AUTO_KNN
        printf("^ KNN: \n\n");
        printf ("\t- Number of samples correctly classified using the KNN classifier: %0.0f\n", acc);
        #endif //AUTO_KNN
        #endif //PRINT

		acc = (acc / N_TEST) * 100.0;
        #ifdef PRINT
        printf("\t- Accuracy: %0.2f%s\n\n", acc, "%");
        #endif

        counter += UPDATE_THR;
		acc = 0;
		acc_perm = 0;

		if(counter > N_TRAIN)
			break;

		n_samples = pipeline(max_samples, root, y_train, n_samples, counter);

		if(counter - INITIAL_THR == MEMORY_SIZE)
			increment = INITIAL_THR;
		else if(counter > MEMORY_SIZE)
			increment += UPDATE_THR;

	}

	return 0;
}

void quicksort_idx(uint16_t y_train[MEMORY_SIZE+UPDATE_THR], uint16_t indices[MEMORY_SIZE + UPDATE_THR], uint16_t first, uint16_t last){
   uint16_t i, j, pivot, temp;

   if(first>=MEMORY_SIZE){
       return;
   }// Avoid useless computation, as the other samples will be cut

   if(first<last){
      pivot=first;
      i=first;
      j=last;

      while(i<j){
         while(weights[indices[i]][y_train[indices[i]]]>=weights[indices[pivot]][y_train[indices[pivot]]]&&i<last)
            i++;
         while(weights[indices[j]][y_train[indices[j]]]<weights[indices[pivot]][y_train[indices[pivot]]])
            j--;
         if(i<j){
            temp=indices[i];
            indices[i]=indices[j];
            indices[j]=temp;
         }
      }

        temp=indices[pivot];
        indices[pivot]=indices[j];
        indices[j]=temp;

      quicksort_idx(y_train, indices,first,j-1);
      quicksort_idx(y_train, indices,j+1,last);

   }
}

uint16_t update_mem(fixed max_samples[MEMORY_SIZE+UPDATE_THR][N_FEATURE], uint16_t indices[MEMORY_SIZE+UPDATE_THR], uint16_t n_samples){
    uint16_t n_samples_updated = n_samples;
	uint16_t i,j,k;
    if (n_samples > MEMORY_SIZE)
        n_samples_updated = MEMORY_SIZE;
    uint16_t n_rows_erased=0;
    uint16_t n_indices_found=0;

	for(i=0; i<n_samples; i++){
        uint16_t row_to_keep = 0;
        for(j=0; j<n_samples_updated-n_indices_found; j++){
            if (i==indices[j]){
                row_to_keep=1;
                for(k=j; k<n_samples_updated-n_indices_found-1; k++){
                    indices[k]=indices[k+1];
                }
                n_indices_found++;
                break;
            }
        }
        if (!row_to_keep){
            for(j=i-n_rows_erased; j<n_samples-1-n_rows_erased; j++){
                for(k=0; k<N_FEATURE; k++){
                    max_samples[j][k]=max_samples[j+1][k];
                    y_train[j] = y_train[j+1];
                }
            }
            n_rows_erased++;
        }
    }
    n_samples = n_samples_updated;
    return n_samples;
}
